In [ ]:
select count(city) - count(distinct city) from station;

# Problem 1
Query the Name of any student in STUDENTS who scored higher than Marks. Order your output by the last three characters of each name.

In [ ]:
#Did not work
select name from students where marks > 75 order by substring(name, length(name)-3, length(name)) ASC;
#normally, I'd troubleshoot the error a little more but seeing as I don't have the table in my normal workspace, 
# (I only have it on HackerRank)
#I am going to move on to attempt two

In [ ]:
#Attempt two:
select name from students where marks > 75 order by right(name, 3) ASC;

In [ ]:
#Great! Got the marks and name ordering down, now just to the next part!
# If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID

.

In [ ]:
select name from students where marks > 75 order by right(name, 3) ASC, id ASC;

# Problem 2

In [ ]:
Write a query to find the maximum total earnings(salary * months) for all employees as well as the total number of employees who have maximum total earnings.

In [ ]:
select MAX(salary*months), count(*) from Employee 
where salary*months = (select MAX(salary*months) from Employee) 
order by salary*months DESC 
LIMIT 1;

# 3

In [ ]:
sum some numbers to 2 decimals
select round(sum(LAT_N),2), round(sum(LONG_W),2) FROM station;

# Pivot table. 
#### I wanted to use the pivot function, so I used sql server not mysql for this one

In [ ]:
SELECT [Doctor], [Professor], [Singer], [Actor]
FROM 
(select *, row_number() over(partition by occupation order by name) as row_num FROM occupations) as tab1
PIVOT 
(MIN(NAME) FOR occupation IN ([Doctor], [Professor], [Singer], [Actor])) AS tab2;

NOTE: PIVOT FUNCTION:
        SELECT <columns> 
        FROM
        (source query)
        PIVOT
        (<agg_func> FOR <spreading_column> IN (<spreading_elements>))

# The cell below is NOT MY CODE
I'm just for my reference in the futre

In [ ]:
# NOT MY CODE
It seems that for My SQL you have to make case statments or a bunch of where statements as prateek_kumar_a1 did below:
    
    with DOCTOR AS (
SELECT  NAME , row_number()OVER(partition by occupation order by name) as rn 
from OCCUPATIONS
WHERE OCCUPATION ='DOCTOR'
) ,
Professor AS (
SELECT NAME ,  row_number()OVER(partition by occupation order by name) as rn 
from OCCUPATIONS
WHERE OCCUPATION ='Professor'
) ,
Singer AS (
SELECT NAME , row_number()OVER(partition by occupation order by name) as rn 
from OCCUPATIONS
WHERE OCCUPATION ='Singer'
) ,
Actor AS (
SELECT NAME , row_number()OVER(partition by occupation order by name) as rn 
from OCCUPATIONS
WHERE OCCUPATION ='Actor'
)
SELECT DOCTOR.NAME,PROFESSOR.NAME,SINGER.NAME,ACTOR.NAME
from doctor right join professor
on DOCTOR.RN=professor.rn
LEFT JOIN
SINGER
on professor.rn=SINGER.RN
LEFT JOIN
ACTOR
on ACTOR.rn=SINGER.RN
;

# City Starts with vowel

In [ ]:
select distinct(city) from station 
where substring(city, 1, 1) = 'a'
OR 
substring(city, 1, 1) = 'e'
OR 
substring(city, 1, 1) = 'i'
OR 
substring(city, 1, 1) = 'o'
OR 
substring(city, 1, 1) = 'u';

In [ ]:
#other ways from other people

In [ ]:
SELECT DISTINCT city FROM station WHERE city REGEXP "^[aeiou]";

In [ ]:
SELECT UNIQUE CITY FROM STATION WHERE CITY LIKE 'A%' OR CITY LIKE 'E%' OR CITY LIKE 'I%' OR CITY LIKE 'O%' OR CITY LIKE 'U%'

In [ ]:
# City ends with vowel:

In [ ]:
I tried the REGEXP method and it worked:
    select distinct(city) from station where city REGEXP '[a,e,i,o,u]$'

In [ ]:
#star and end in vowel

In [ ]:
select distinct(city) from station where city regexp '^[a,e,i,o,u]' AND city regexp '[a,e,i,o,u]$';
NOTE regexp '^[a,e,i,o,u]$' did NOT work

In [ ]:
# begins with NOT a vowel
select distinct(city) from station where city regexp '^[^a,e,i,o,u]'

In [ ]:
# does not end with a vowel
select distinct(city) from station where city REGEXP '[^a,e,i,o,u]$'